## Importing

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_raw =  pd.read_csv("index2018.csv")
df_cpy = df_raw.copy()

## Lenght of a time period

In [3]:
df_cpy.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

In [4]:
df_cpy.date = pd.to_datetime(df_cpy.date, dayfirst = True)

In [5]:
df_cpy.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [6]:
df_cpy.date.describe()

C:\Users\mzz30\AppData\Local\Temp/ipykernel_3200/2832476070.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df_cpy.date.describe()

count                    6269
unique                   6269
top       1994-01-07 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

## Setting the date as index

In [7]:
df_cpy.set_index("date",inplace = True)

In [8]:
df_cpy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

## Setting the frequency

In [9]:
df_cpy =  df_cpy.asfreq('b')

In [10]:
df_cpy.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

## Handling the missing values

In [11]:
df_cpy.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

### front filling, back filling and average filling

In [12]:
df_cpy.spx = df_cpy.spx.fillna(method = "ffill")

In [13]:
df_cpy.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

There is backfilling with 'bfill' and the averagefilling  with passing a number fillna(df_cpy.spx.mean())

## Simplifying the dataset

In [14]:
df_cpy["market_value"] = df_cpy.spx

In [15]:
df_cpy.head()

               spx      dax     ftse    nikkei  market_value
date
1994-01-07  469.90  2224.95  3445.98  18124.01        469.90
1994-01-10  475.27  2225.00  3440.58  18443.44        475.27
1994-01-11  474.13  2228.10  3413.77  18485.25        474.13
1994-01-12  474.17  2182.06  3372.02  18793.88        474.17
1994-01-13  472.47  2142.37  3360.01  18577.26        472.47

In [16]:
df_cpy.drop(["dax","spx","ftse","nikkei"], axis = 1, inplace = True )

In [18]:
df_cpy.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

## Splitting the dataset

In [20]:
# Calculating the 0.8
tSize = int(len(df_cpy)*0.8)

# Splitting
trainSet = df_cpy.iloc[:tSize]
testSet = df_cpy.iloc[tSize:]